<style lang="scss">
    @import './index.scss';

</style>
<template>
    <div class="document-page-html">
        <h1>表单组件-文本框</h1>
        <h2>概述</h2>

        <p>1、文本框的使用场景，分为单行文本框和多行文本框。输入字数在30以内的，使用单行文本框，超过30的使用多行文本框。</p>
        <p>2、表单里的文本框布局，标题靠左，输入框靠右。 </p>
        <p>3、文本框宽度使用栅格布局，可参考表单页面布局的章节。</p>
        <p>4、文本框要有提示文字，如是特殊的文本框，提示文字要跟字段意思保持一致。</p>
    
        <h2>输入提示</h2>
        <p>必填字段，要有填写提示。如是有特殊意义的字段，提示文字要和字段意义保持一致。</p>
        <h2>特殊输入框</h2>
        <p>特殊输入框，可带有前缀、后缀、图标等。如查询的输入框可使用。</p>
        <h2>多行文本输入框</h2>
        <p>当输入的文本字数超过30时，使用多文本输入框。多文本输入框，默认显示3行，最多显示9行。</p>
        <h2>不可编辑文本框</h2>
        <p>当文本框不可编辑时，当鼠标移入时，应提示不可编辑手势  。并使用不可编辑的文本框。</p>


    </div>
</template>
<script>
    /**
     * 颜色
     */
    export default {
        data () {
            return {
            }
        },
        created(){
            // console.log("刷新了111");
        },
        methods:{

        }
    }
</script>

