<style lang="scss">
    @import './index.scss';

</style>
<template>
    <div class="document-page-html">
        <h1>按钮</h1>
        <h2>概述</h2>
        <p>按钮类型有默认按钮、主按钮、虚线按钮、文字按钮以及四种颜色按钮。根据不同的业务场景，选用不同类型，以及不同颜色的按钮。</p>

        <h2>按钮尺寸</h2>
        <p>按钮的尺寸分为三类：大尺寸按钮、标准按钮、小尺寸按钮。</p>
        <h2>幽灵按钮</h2>
        <p>幽灵按钮将其他按钮的内容反色，背景变为透明，常用在有色背景上。</p>
        <h2>图标按钮</h2>
        <p>通过在按钮里面放置icon图标，可更明确的表达按钮的意义。有助于培养用户的操作习惯。</p>
        <h2>组合按钮</h2>
        <p>在复杂的业务场景，使用组合按钮，可更简单的区分不同的业务。组合按钮的尺寸与单个按钮的尺寸、字号保持一致。只是按钮之间没有间距。</p>
        <h2>不可编辑按钮</h2>
        <p>在按钮不可编辑的情况下，需增加不可编辑的手势  ，并使用不可编辑按钮。</p>
    
    
    
    
    </div>
</template>
<script>
    /**
     * 颜色
     */
    export default {
        data () {
            return {
            }
        },
        created(){
            // console.log("刷新了111");
        },
        methods:{

        }
    }
</script>

